package com.arman.horus.models;

import com.arman.horus.R;

/**
 * Created by arman on 4/2/16.
 */
public class TripDetail {

    public int images;
    public String title;
    public String description;
    //TODO: Change type to something like iDate
    public String startDate;
    public String from;
    public String to;
    public String id;

    public TripDetail(int images, String title, String description, String startDate, String from, String to, String id) {
        this.images = images;
        this.title = title;
        this.description = description;
        this.startDate = startDate;
        this.from = from;
        this.to = to;
        this.id = id;
    }

    public static TripDetail dummyTripDetail() {
        String description = "Հայերեն (ավանդական՝ հայերէն), հնդեվրոպական լեզվաընտանիքի առանձին ճյուղ հանդիսացող լեզու։ Հայաստանի և Լեռնային Ղարաբաղի Հանրապետության[Ն 1] պետական լեզուն է։ Իր շուրջ հինգհազարամյա գոյության ընթացքում հայերենը շփվել է տարբեր ժողովուրդների, բազմաթիվ լեզուների հետ, սակայն պահպանել է իր ինքնուրույնությունը, քերականական կառուցվածքի և բառապաշարի (բառային ֆոնդի) ինքնատիպությունը։\n" +
                "\n" +
                "Հայոց լեզվով ստեղծվել է մեծ գրականություն։ Գրաբարով է ավանդված հայ հին պատմագրությունը, գիտափիլիսոփայական, մաթեմատիկական, բժշկագիտական, աստվածաբանական-դավանաբանական գրականությունը։ Միջին գրական հայերենով են մեզ հասել միջնադարյան հայ քնարերգության գլուխգործոցները, բժշկագիտական, իրավագիտական նշանակալի աշխատություններ։ Գրական նոր հայերենի արևելահայերեն ու արևմտահայերեն գրական տարբերակներով ստեղծվել է գեղարվեստական, հրապարակախոսական ու գիտական բազմատիպ ու բազմաբնույթ հարուստ գրականություն։\n" +
                "\n" +
                "Հայերենը լայնորեն օգտագործվում է պատմական Հայաստանի տարածքներում (Ջավախք, Պարսկահայք, Արևմտյան Հայաստանի որոշ շրջաններ) և Հայկական սփյուռքում։ Առավել կիրառական է Եվրոպայում (Ֆրանսիա, Գերմանիա, Իսպանիա, Բելգիա, Շվեյցարիա, Իտալիա, Հունաստան, Բուլղարիա և այլն), Մերձավոր Արևելքում (հիմնականում Իրան, Սիրիա, Լիբանան, Իրաք, Պաղեստին, Իսրայել, Եգիպտոս, մասամբ՝ Թուրքիա) և նախկին ԽՍՀՄ հանրապետություններում՝ Ռուսաստանի Դաշնությունում (Հարավային դաշնային տարածաշրջան, Մոսկվա և խոշոր քաղաքներ), Վրաստանում, Ուկրաինայում և այլուր։\n" +
                "\n" +
                "Արևմտյան կիսագնդում հայերեն են խոսում ԱՄՆ-ում, Կանադայում, Լատինական Ամերիկայում (Ուրուգվայ, Արգենտինա, Բրազիլիա)։ Հայկական համայնքներ կան նաև Աֆրիկայում, Ավստրալիայում և այլուր։";
        return new TripDetail(R.drawable.trip1, "Trip to Maymekh", description, "15:32", "Tigran Mets 15/34", "Maymekh top", "item_1");
    }
}
